madshobye/Portal/arduinolibs/ESP32_UVC_Direct/src/ESP32UVCDirect.cpp
#include "ESP32UVCDirect.h"

#include <stdarg.h>

ESP32UVCDirect *ESP32UVCDirect::_active = nullptr;

ESP32UVCDirect::ESP32UVCDirect() {}

void ESP32UVCDirect::setLogStream(Stream *stream) {
  _log = stream ? stream : &Serial;
}

void ESP32UVCDirect::setFrameCallback(FrameCallback callback, void *user) {
  _frameCallback = callback;
  _frameUser = user;
}

bool ESP32UVCDirect::begin(const Config &config) {
  _config = config;
  _active = this;

#if defined(CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE)
  if (CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE < 1024) {
    logf("warning: CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=%u, many UVC cameras need >256\r\n",
         unsigned(CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE));
  }
#endif

  if (!_deviceQueue) {
    _deviceQueue = xQueueCreate(4, sizeof(uint8_t));
  }
  if (!_controlDone) {
    _controlDone = xSemaphoreCreateBinary();
  }
  if (!_deviceQueue || !_controlDone) {
    setError("queue/semaphore allocation failed");
    logf("%s\r\n", _lastError);
    return false;
  }
  return installHost();
}

bool ESP32UVCDirect::begin() {
  Config config;
  return begin(config);
}

void ESP32UVCDirect::printStatus() {
  uint8_t addresses[8] = {};
  int count = 0;
  usb_host_device_addr_list_fill(8, addresses, &count);
  logf("uvc status devices=%d ready=%u streaming=%u payloads=%lu frames=%lu frameBytes=%lu\r\n",
       count,
       _deviceReady ? 1 : 0,
       _streaming ? 1 : 0,
       (unsigned long)_payloadCount,
       (unsigned long)_frameCount,
       (unsigned long)_frameBytes);
}

bool ESP32UVCDirect::installHost() {
  if (_hostStarted) {
    return true;
  }

  const usb_host_config_t hostConfig = {
    .skip_phy_setup = false,
    .root_port_unpowered = false,
    .intr_flags = ESP_INTR_FLAG_LEVEL1,
    .enum_filter_cb = nullptr,
    .fifo_settings_custom = {
      .nptx_fifo_lines = 16,
      .ptx_fifo_lines = 16,
      .rx_fifo_lines = 96,
    },
    .peripheral_map = 0,
  };

  esp_err_t err = usb_host_install(&hostConfig);
  if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
    setError(esp_err_to_name(err));
    logf("USB host install failed: %s\r\n", _lastError);
    return false;
  }

  _hostStarted = true;
  if (!_hostTaskHandle) {
    xTaskCreatePinnedToCore(hostTaskThunk, "uvc_usb_host", USB_HOST_TASK_STACK, this, 4, &_hostTaskHandle, 1);
  }
  if (!_clientTaskHandle) {
    xTaskCreatePinnedToCore(clientTaskThunk, "uvc_client", USB_CLIENT_TASK_STACK, this, 5, &_clientTaskHandle, 1);
  }
  logf("UVC direct USB host installed fifo rx=96 nptx=16 ptx=16\r\n");
  return true;
}

void ESP32UVCDirect::hostTaskThunk(void *arg) {
  static_cast<ESP32UVCDirect *>(arg)->hostTask();
}

void ESP32UVCDirect::clientTaskThunk(void *arg) {
  static_cast<ESP32UVCDirect *>(arg)->clientTask();
}

void ESP32UVCDirect::clientEventThunk(const usb_host_client_event_msg_t *event, void *arg) {
  static_cast<ESP32UVCDirect *>(arg)->onClientEvent(event);
}

void ESP32UVCDirect::controlCallbackThunk(usb_transfer_t *transfer) {
  if (_active) {
    _active->onControlComplete(transfer);
  }
}

void ESP32UVCDirect::streamCallbackThunk(usb_transfer_t *transfer) {
  auto *streamTransfer = static_cast<StreamTransfer *>(transfer->context);
  if (streamTransfer && streamTransfer->self) {
    streamTransfer->self->onStreamComplete(streamTransfer);
  }
}

void ESP32UVCDirect::hostTask() {
  for (;;) {
    uint32_t eventFlags = 0;
    usb_host_lib_handle_events(portMAX_DELAY, &eventFlags);
    if (eventFlags & USB_HOST_LIB_EVENT_FLAGS_NO_CLIENTS) {
      usb_host_device_free_all();
    }
  }
}

void ESP32UVCDirect::clientTask() {
  const usb_host_client_config_t clientConfig = {
    .is_synchronous = false,
    .max_num_event_msg = 8,
    .async = {
      .client_event_callback = clientEventThunk,
      .callback_arg = this,
    },
  };

  esp_err_t err = usb_host_client_register(&clientConfig, &_client);
  if (err != ESP_OK) {
    setError(esp_err_to_name(err));
    logf("UVC client register failed: %s\r\n", _lastError);
    vTaskDelete(nullptr);
    return;
  }

  logf("UVC direct client ready\r\n");
  for (;;) {
    usb_host_client_handle_events(_client, pdMS_TO_TICKS(50));
    uint8_t address = 0;
    if (xQueueReceive(_deviceQueue, &address, 0) == pdTRUE) {
      openAndProbe(address);
    }
  }
}

void ESP32UVCDirect::onClientEvent(const usb_host_client_event_msg_t *event) {
  if (event->event == USB_HOST_CLIENT_EVENT_NEW_DEV) {
    const uint8_t address = event->new_dev.address;
    logf("UVC USB device connected addr=%u\r\n", address);
    xQueueSend(_deviceQueue, &address, 0);
  } else if (event->event == USB_HOST_CLIENT_EVENT_DEV_GONE) {
    logf("UVC USB device gone\r\n");
    closeDevice();
  }
}

void ESP32UVCDirect::onControlComplete(usb_transfer_t *transfer) {
  _lastControlStatus = transfer->status;
  _lastControlActualBytes = transfer->actual_num_bytes;
  if (_controlDone) {
    xSemaphoreGive(_controlDone);
  }
}

void ESP32UVCDirect::openAndProbe(uint8_t address) {
  closeDevice();

  esp_err_t err = usb_host_device_open(_client, address, &_device);
  if (err != ESP_OK) {
    setError(esp_err_to_name(err));
    logf("UVC open addr=%u failed: %s\r\n", address, _lastError);
    return;
  }

  const usb_device_desc_t *deviceDesc = nullptr;
  if (usb_host_get_device_descriptor(_device, &deviceDesc) == ESP_OK && deviceDesc) {
    logf("UVC device vid=0x%04x pid=0x%04x class=0x%02x mps0=%u\r\n",
         deviceDesc->idVendor,
         deviceDesc->idProduct,
         deviceDesc->bDeviceClass,
         deviceDesc->bMaxPacketSize0);
  }

  const usb_config_desc_t *config = nullptr;
  err = usb_host_get_active_config_descriptor(_device, &config);
  if (err != ESP_OK || !config) {
    setError(esp_err_to_name(err));
    logf("UVC config descriptor failed: %s\r\n", _lastError);
    closeDevice();
    return;
  }

  Target target;
  if (!parseTarget(config, target)) {
    setError("no usable UVC streaming target");
    logf("%s\r\n", _lastError);
    closeDevice();
    return;
  }
  _target = target;

