madshobye/Portal/arduinolibs/ESP32_UVC_Direct/src/ESP32UVCDirect.cpp
  logf("UVC target ctrl=%u stream=%u alt=%u format=%u frame=%u %ux%u mjpeg=%u ep=0x%02x type=%u mps=%u\r\n",
       _target.controlInterface,
       _target.streamInterface,
       _target.endpointAlt,
       _target.formatIndex,
       _target.frameIndex,
       _target.width,
       _target.height,
       _target.mjpeg ? 1 : 0,
       _target.endpointAddress,
       _target.endpointType,
       _target.endpointMps);
  logf("UVC target interval=%lu maxFrame=%lu\r\n",
       (unsigned long)_target.frameInterval100ns,
       (unsigned long)_target.maxFrameBytes);

  if (!negotiate(_target)) {
    closeDevice();
    return;
  }

  _deviceReady = true;
  if (_config.startStreaming) {
    startStream();
  }
}

void ESP32UVCDirect::closeDevice() {
  stopStream();
  if (_device && _claimedStream && _client && _target.streamInterface != 0xff) {
    usb_host_interface_release(_client, _device, _target.streamInterface);
  }
  _claimedStream = false;
  _claimedAlt0 = false;
  if (_device && _claimedControl && _client && _target.controlInterface != 0xff) {
    usb_host_interface_release(_client, _device, _target.controlInterface);
  }
  _claimedControl = false;
  if (_device && _client) {
    usb_host_device_close(_client, _device);
  }
  _device = nullptr;
  _deviceReady = false;
  _target = Target();
}

bool ESP32UVCDirect::parseTarget(const usb_config_desc_t *config, Target &target) {
  constexpr uint16_t maxSupportedIsocMps = (96 - 2) * 4;
  const uint8_t *bytes = reinterpret_cast<const uint8_t *>(config);
  const uint8_t *end = bytes + config->wTotalLength;
  const usb_intf_desc_t *currentInterface = nullptr;
  uint8_t lastFormatIndex = 0;
  bool lastFormatMjpeg = false;

  logf("UVC config total=%u interfaces=%u\r\n", config->wTotalLength, config->bNumInterfaces);

  for (const uint8_t *ptr = bytes; ptr + USB_STANDARD_DESC_SIZE <= end;) {
    const auto *standard = reinterpret_cast<const usb_standard_desc_t *>(ptr);
    if (standard->bLength < USB_STANDARD_DESC_SIZE || ptr + standard->bLength > end) {
      logf("UVC descriptor parse stopped: invalid length\r\n");
      break;
    }

    if (standard->bDescriptorType == USB_B_DESCRIPTOR_TYPE_INTERFACE && standard->bLength >= USB_INTF_DESC_SIZE) {
      currentInterface = reinterpret_cast<const usb_intf_desc_t *>(ptr);
      logf("UVC interface %u alt=%u class=0x%02x subclass=0x%02x endpoints=%u\r\n",
           currentInterface->bInterfaceNumber,
           currentInterface->bAlternateSetting,
           currentInterface->bInterfaceClass,
           currentInterface->bInterfaceSubClass,
           currentInterface->bNumEndpoints);

      if (currentInterface->bInterfaceClass == UVC_CLASS_VIDEO &&
          currentInterface->bInterfaceSubClass == UVC_SC_VIDEOCONTROL) {
        target.controlInterface = currentInterface->bInterfaceNumber;
      } else if (currentInterface->bInterfaceClass == UVC_CLASS_VIDEO &&
                 currentInterface->bInterfaceSubClass == UVC_SC_VIDEOSTREAMING &&
                 target.streamInterface == 0xff) {
        target.streamInterface = currentInterface->bInterfaceNumber;
      }
    } else if (standard->bDescriptorType == USB_B_DESCRIPTOR_TYPE_ENDPOINT &&
               standard->bLength >= USB_EP_DESC_SIZE &&
               currentInterface) {
      const auto *endpoint = reinterpret_cast<const usb_ep_desc_t *>(ptr);
      const uint8_t type = USB_EP_DESC_GET_XFERTYPE(endpoint);
      const uint16_t mps = USB_EP_DESC_GET_MPS(endpoint);
      logf("  UVC endpoint 0x%02x type=%u mps=%u interval=%u\r\n",
           endpoint->bEndpointAddress,
           type,
           mps,
           endpoint->bInterval);

      if (currentInterface->bInterfaceClass == UVC_CLASS_VIDEO &&
          currentInterface->bInterfaceSubClass == UVC_SC_VIDEOSTREAMING &&
          (endpoint->bEndpointAddress & 0x80)) {
        const bool endpointUnset = target.endpointAddress == 0;
        const bool preferBulk = target.endpointType != USB_TRANSFER_TYPE_BULK && type == USB_TRANSFER_TYPE_BULK;
        const bool supportedIsoc = type != USB_TRANSFER_TYPE_ISOCHRONOUS || mps <= maxSupportedIsocMps;
        const bool largerIsoc = target.endpointType == USB_TRANSFER_TYPE_ISOCHRONOUS &&
                                type == USB_TRANSFER_TYPE_ISOCHRONOUS &&
                                mps > target.endpointMps &&
                                supportedIsoc;
        if ((endpointUnset && supportedIsoc) || preferBulk || largerIsoc) {
          target.endpointAddress = endpoint->bEndpointAddress;
          target.endpointType = type;
          target.endpointMps = mps;
          target.endpointInterval = endpoint->bInterval;
          target.endpointAlt = currentInterface->bAlternateSetting;
        }
      }
    } else if (standard->bDescriptorType == CS_INTERFACE && standard->bLength >= 4 && currentInterface) {
      const uint8_t subtype = ptr[2];
      if (currentInterface->bInterfaceClass == UVC_CLASS_VIDEO &&
          currentInterface->bInterfaceSubClass == UVC_SC_VIDEOSTREAMING) {
        if ((subtype == VS_FORMAT_UNCOMPRESSED || subtype == VS_FORMAT_MJPEG) && standard->bLength >= 5) {
          lastFormatIndex = ptr[3];
          lastFormatMjpeg = subtype == VS_FORMAT_MJPEG;
          logf("  UVC format subtype=0x%02x index=%u\r\n", subtype, lastFormatIndex);
        } else if ((subtype == VS_FRAME_UNCOMPRESSED || subtype == VS_FRAME_MJPEG) && standard->bLength >= 26) {
          Target candidate = target;
          candidate.found = true;
          candidate.formatIndex = lastFormatIndex;
          candidate.frameIndex = ptr[3];
          candidate.width = rd16(ptr + 5);
          candidate.height = rd16(ptr + 7);
          candidate.mjpeg = lastFormatMjpeg || subtype == VS_FRAME_MJPEG;
          candidate.maxFrameBytes = rd32(ptr + 17);
          candidate.frameInterval100ns = rd32(ptr + 21);
          const uint8_t intervalType = ptr[25];
          if (intervalType > 0 && standard->bLength >= 26 + intervalType * 4) {
            uint32_t bestInterval = rd32(ptr + 26);
            uint32_t bestDelta = UINT32_MAX;
            for (uint8_t i = 0; i < intervalType; i++) {
              const uint32_t interval = rd32(ptr + 26 + i * 4);
              const uint32_t delta = interval > _config.frameInterval100ns
                ? interval - _config.frameInterval100ns
                : _config.frameInterval100ns - interval;
              if (delta < bestDelta) {
                bestDelta = delta;
                bestInterval = interval;
              }
            }
            candidate.frameInterval100ns = bestInterval;
          }
          logf("  UVC frame subtype=0x%02x index=%u %ux%u max=%lu interval=%lu type=%u\r\n",
               subtype,
               candidate.frameIndex,
               candidate.width,
               candidate.height,
               (unsigned long)candidate.maxFrameBytes,
               (unsigned long)candidate.frameInterval100ns,
               intervalType);
          if (lastFormatIndex != 0 && isBetterFrame(candidate, target)) {
            target.found = true;
            target.formatIndex = candidate.formatIndex;
            target.frameIndex = candidate.frameIndex;
            target.width = candidate.width;
            target.height = candidate.height;
            target.frameInterval100ns = candidate.frameInterval100ns;
            target.maxFrameBytes = candidate.maxFrameBytes;
            target.mjpeg = candidate.mjpeg;
          }
        }
      }
    }

