madshobye/Portal/arduinolibs/ESP32_UVC_Direct/src/ESP32UVCDirect.cpp
    ptr += standard->bLength;
  }

  return target.controlInterface != 0xff &&
         target.streamInterface != 0xff &&
         target.endpointAddress != 0 &&
         target.found;
}

bool ESP32UVCDirect::isBetterFrame(const Target &candidate, const Target &current) const {
  if (!current.found) {
    return true;
  }
  if (candidate.width == _config.preferredWidth && candidate.height == _config.preferredHeight &&
      (current.width != _config.preferredWidth || current.height != _config.preferredHeight)) {
    return true;
  }
  if (candidate.mjpeg == _config.preferMjpeg && current.mjpeg != _config.preferMjpeg) {
    return true;
  }
  const uint32_t candidateDelta = abs(int(candidate.width) - int(_config.preferredWidth)) +
                                  abs(int(candidate.height) - int(_config.preferredHeight));
  const uint32_t currentDelta = abs(int(current.width) - int(_config.preferredWidth)) +
                                abs(int(current.height) - int(_config.preferredHeight));
  return candidateDelta < currentDelta;
}

bool ESP32UVCDirect::negotiate(Target &target) {
  esp_err_t err = usb_host_interface_claim(_client, _device, target.controlInterface, 0);
  if (err != ESP_OK) {
    setError(esp_err_to_name(err));
    logf("UVC claim control interface %u failed: %s\r\n", target.controlInterface, _lastError);
    return false;
  }
  _claimedControl = true;
  logf("UVC claimed control interface %u\r\n", target.controlInterface);

  err = usb_host_interface_claim(_client, _device, target.streamInterface, 0);
  if (err != ESP_OK) {
    setError(esp_err_to_name(err));
    logf("UVC claim stream interface %u alt 0 failed: %s\r\n", target.streamInterface, _lastError);
    return false;
  }
  _claimedStream = true;
  _claimedAlt0 = true;
  logf("UVC claimed stream interface %u alt 0\r\n", target.streamInterface);

  uint8_t probe[UVC_PROBE_LEN] = {};
  const uint16_t index = target.streamInterface;

  memset(probe, 0, sizeof(probe));
  if (!submitControl(_device, 0xa1, UVC_GET_CUR, uint16_t(UVC_VS_PROBE_CONTROL) << 8, index, probe, UVC_PROBE_LEN, "GET_CUR PROBE")) {
    return false;
  }
  logf("UVC probe:");
  for (size_t i = 0; i < UVC_PROBE_LEN; i++) {
    logf(" %02x", probe[i]);
  }
  logf("\r\n");

  return true;
}

bool ESP32UVCDirect::startStream() {
  if (!_device || _streaming || !_target.endpointAddress || !_target.endpointMps) {
    return false;
  }

  if (_claimedStream && _claimedAlt0 && _target.endpointAlt != 0) {
    usb_host_interface_release(_client, _device, _target.streamInterface);
    _claimedAlt0 = false;
    _claimedStream = false;
  }

  if (!_claimedStream) {
    esp_err_t err = usb_host_interface_claim(_client, _device, _target.streamInterface, _target.endpointAlt);
    if (err != ESP_OK) {
      setError(esp_err_to_name(err));
      logf("UVC claim stream interface %u alt %u failed: %s\r\n", _target.streamInterface, _target.endpointAlt, _lastError);
      return false;
    }
    _claimedStream = true;
    _claimedAlt0 = _target.endpointAlt == 0;
    logf("UVC claimed stream interface %u alt %u\r\n", _target.streamInterface, _target.endpointAlt);
  }

  _streamTransferCount = max<uint8_t>(1, _config.streamTransferCount);
  _streamTransfers = static_cast<StreamTransfer *>(calloc(_streamTransferCount, sizeof(StreamTransfer)));
  if (!_streamTransfers) {
    setError("stream transfer allocation failed");
    logf("%s\r\n", _lastError);
    return false;
  }

  _streaming = true;
  _payloadCount = 0;
  _frameCount = 0;
  _frameBytes = 0;
  _lastFid = 0xff;

  for (uint8_t i = 0; i < _streamTransferCount; i++) {
    StreamTransfer &streamTransfer = _streamTransfers[i];
    streamTransfer.self = this;
    const bool isIsoc = _target.endpointType == USB_TRANSFER_TYPE_ISOCHRONOUS;
    const int isocPackets = isIsoc ? max<uint8_t>(1, _config.isocPacketsPerTransfer) : 0;
    const size_t packetBytes = max<uint16_t>(1, _target.endpointMps);
    const size_t transferBytes = isIsoc ? packetBytes * isocPackets : packetBytes * max<uint16_t>(1, _config.bulkPacketsPerTransfer);
    streamTransfer.packetBytes = packetBytes;
    esp_err_t err = usb_host_transfer_alloc(transferBytes, isocPackets, &streamTransfer.transfer);
    if (err != ESP_OK || !streamTransfer.transfer) {
      setError(esp_err_to_name(err));
      logf("UVC stream transfer alloc failed: %s\r\n", _lastError);
      stopStream();
      return false;
    }
    streamTransfer.transfer->device_handle = _device;
    streamTransfer.transfer->bEndpointAddress = _target.endpointAddress;
    streamTransfer.transfer->callback = streamCallbackThunk;
    streamTransfer.transfer->context = &streamTransfer;
    streamTransfer.transfer->timeout_ms = 1000;
    if (!submitStreamTransfer(&streamTransfer)) {
      stopStream();
      return false;
    }
  }

  logf("UVC streaming started ep=0x%02x type=%u transfers=%u\r\n",
       _target.endpointAddress,
       _target.endpointType,
       _streamTransferCount);
  return true;
}

void ESP32UVCDirect::stopStream() {
  _streaming = false;
  if (_streamTransfers) {
    for (uint8_t i = 0; i < _streamTransferCount; i++) {
      if (_streamTransfers[i].transfer) {
        usb_host_transfer_free(_streamTransfers[i].transfer);
      }
    }
    free(_streamTransfers);
  }
  _streamTransfers = nullptr;
  _streamTransferCount = 0;
}

bool ESP32UVCDirect::submitStreamTransfer(StreamTransfer *streamTransfer) {
  if (!streamTransfer || !streamTransfer->transfer) {
    return false;
  }
  usb_transfer_t *transfer = streamTransfer->transfer;
  const bool isIsoc = _target.endpointType == USB_TRANSFER_TYPE_ISOCHRONOUS;
  transfer->actual_num_bytes = 0;
  transfer->flags = 0;
  if (isIsoc) {
    transfer->num_bytes = streamTransfer->packetBytes * transfer->num_isoc_packets;
    for (int i = 0; i < transfer->num_isoc_packets; i++) {
      transfer->isoc_packet_desc[i].num_bytes = streamTransfer->packetBytes;
      transfer->isoc_packet_desc[i].actual_num_bytes = 0;
      transfer->isoc_packet_desc[i].status = USB_TRANSFER_STATUS_ERROR;
    }
  } else {
    transfer->num_bytes = transfer->data_buffer_size;
  }
  esp_err_t err = usb_host_transfer_submit(transfer);
  if (err != ESP_OK) {
    setError(esp_err_to_name(err));
    logf("UVC stream submit failed: %s\r\n", _lastError);
    return false;
  }
  return true;
}

