madshobye/Portal/arduinolibs/ESP32_UVC_Direct/src/ESP32UVCDirect.cpp
void ESP32UVCDirect::onStreamComplete(StreamTransfer *streamTransfer) {
  if (!streamTransfer || !streamTransfer->transfer) {
    return;
  }
  usb_transfer_t *transfer = streamTransfer->transfer;
  if (transfer->status == USB_TRANSFER_STATUS_COMPLETED) {
    if (_target.endpointType == USB_TRANSFER_TYPE_ISOCHRONOUS) {
      size_t offset = 0;
      for (int i = 0; i < transfer->num_isoc_packets; i++) {
        const auto &packet = transfer->isoc_packet_desc[i];
        if (packet.status == USB_TRANSFER_STATUS_COMPLETED && packet.actual_num_bytes > 0) {
          handlePayload(transfer->data_buffer + offset, packet.actual_num_bytes);
        }
        offset += streamTransfer->packetBytes;
      }
    } else if (transfer->actual_num_bytes > 0) {
      handlePayload(transfer->data_buffer, transfer->actual_num_bytes);
    }
  } else if (transfer->status != USB_TRANSFER_STATUS_CANCELED && transfer->status != USB_TRANSFER_STATUS_NO_DEVICE) {
    logf("UVC stream transfer status=%d actual=%d\r\n", int(transfer->status), transfer->actual_num_bytes);
  }

  if (_streaming) {
    submitStreamTransfer(streamTransfer);
  }
}

void ESP32UVCDirect::handlePayload(const uint8_t *data, size_t length) {
  if (!data || length < 2) {
    return;
  }
  const uint8_t headerLength = data[0];
  const uint8_t flags = data[1];
  if (headerLength < 2 || headerLength > length) {
    return;
  }
  const uint8_t fid = flags & 0x01;
  const bool eof = flags & 0x02;
  const size_t payloadLength = length - headerLength;
  if (_lastFid != 0xff && fid != _lastFid && _frameBytes > 0) {
    _frameCount++;
    logf("UVC frame #%lu bytes=%lu fid-toggle\r\n", (unsigned long)_frameCount, (unsigned long)_frameBytes);
    _frameBytes = 0;
  }
  _lastFid = fid;
  _payloadCount++;
  _frameBytes += payloadLength;
  if (_frameCallback && payloadLength > 0) {
    _frameCallback(data + headerLength, payloadLength, eof, _frameUser);
  }
  if (eof) {
    _frameCount++;
    logf("UVC frame #%lu bytes=%lu eof payloads=%lu\r\n",
         (unsigned long)_frameCount,
         (unsigned long)_frameBytes,
         (unsigned long)_payloadCount);
    _frameBytes = 0;
  } else if (_payloadCount <= 10 || (_payloadCount % 100) == 0) {
    logf("UVC payload #%lu len=%u data=%u flags=0x%02x\r\n",
         (unsigned long)_payloadCount,
         unsigned(length),
         unsigned(payloadLength),
         flags);
  }
}

bool ESP32UVCDirect::submitControl(
  usb_device_handle_t device,
  uint8_t requestType,
  uint8_t request,
  uint16_t value,
  uint16_t index,
  uint8_t *payload,
  size_t payloadLen,
  const char *label
) {
  usb_transfer_t *transfer = nullptr;
  esp_err_t err = usb_host_transfer_alloc(USB_SETUP_PACKET_SIZE + payloadLen, 0, &transfer);
  if (err != ESP_OK) {
    setError(esp_err_to_name(err));
    logf("%s alloc failed: %s\r\n", label, _lastError);
    return false;
  }

  transfer->device_handle = device;
  transfer->bEndpointAddress = 0;
  transfer->callback = controlCallbackThunk;
  transfer->context = this;
  transfer->num_bytes = USB_SETUP_PACKET_SIZE + payloadLen;
  transfer->actual_num_bytes = 0;
  transfer->timeout_ms = _config.controlTimeoutMs;
  transfer->flags = 0;

  auto *setup = reinterpret_cast<usb_setup_packet_t *>(transfer->data_buffer);
  setup->bmRequestType = requestType;
  setup->bRequest = request;
  setup->wValue = value;
  setup->wIndex = index;
  setup->wLength = payloadLen;
  if (payloadLen > 0 && payload) {
    memcpy(transfer->data_buffer + USB_SETUP_PACKET_SIZE, payload, payloadLen);
  }

  _lastControlStatus = USB_TRANSFER_STATUS_ERROR;
  _lastControlActualBytes = 0;
  xSemaphoreTake(_controlDone, 0);

  err = usb_host_transfer_submit_control(_client, transfer);
  if (err != ESP_OK) {
    setError(esp_err_to_name(err));
    logf("%s submit failed: %s\r\n", label, _lastError);
    usb_host_transfer_free(transfer);
    return false;
  }

  const uint32_t started = millis();
  while (xSemaphoreTake(_controlDone, pdMS_TO_TICKS(20)) != pdTRUE) {
    usb_host_client_handle_events(_client, 0);
    if (millis() - started > _config.controlTimeoutMs) {
      setError("control transfer timed out");
      logf("%s timed out\r\n", label);
      usb_host_transfer_free(transfer);
      return false;
    }
  }

  if ((requestType & 0x80) && payloadLen > 0 && payload) {
    memcpy(payload, transfer->data_buffer + USB_SETUP_PACKET_SIZE, payloadLen);
  }

  logf("%s done status=%d actual=%d bytes\r\n", label, int(_lastControlStatus), _lastControlActualBytes);
  const bool ok = _lastControlStatus == USB_TRANSFER_STATUS_COMPLETED;
  if (!ok) {
    setError("control transfer failed");
  }
  usb_host_transfer_free(transfer);
  return ok;
}

void ESP32UVCDirect::fillProbe(uint8_t *data, const Target &target, bool includeSizes) const {
  memset(data, 0, UVC_PROBE_LEN);
  wr16(data + 0, 0);
  data[2] = target.formatIndex;
  data[3] = target.frameIndex;
  wr32(data + 4, target.frameInterval100ns ? target.frameInterval100ns : _config.frameInterval100ns);
  wr16(data + 8, 0);
  wr16(data + 10, 0);
  wr16(data + 12, 0);
  wr16(data + 14, 0);
  wr16(data + 16, 0);
  if (includeSizes) {
    uint32_t frameBytes = target.maxFrameBytes;
    if (frameBytes == 0) {
      frameBytes = uint32_t(target.width) * uint32_t(target.height) * (target.mjpeg ? 1 : 2);
    }
    wr32(data + 18, frameBytes);
    wr32(data + 22, target.endpointMps ? target.endpointMps : 512);
  }
}

uint16_t ESP32UVCDirect::rd16(const uint8_t *p) {
  return uint16_t(p[0]) | (uint16_t(p[1]) << 8);
}

uint32_t ESP32UVCDirect::rd32(const uint8_t *p) {
  return uint32_t(p[0]) |
         (uint32_t(p[1]) << 8) |
         (uint32_t(p[2]) << 16) |
         (uint32_t(p[3]) << 24);
}

void ESP32UVCDirect::wr16(uint8_t *p, uint16_t value) {
  p[0] = uint8_t(value & 0xff);
  p[1] = uint8_t((value >> 8) & 0xff);
}

void ESP32UVCDirect::wr32(uint8_t *p, uint32_t value) {
  p[0] = uint8_t(value & 0xff);
  p[1] = uint8_t((value >> 8) & 0xff);
  p[2] = uint8_t((value >> 16) & 0xff);
  p[3] = uint8_t((value >> 24) & 0xff);
}

void ESP32UVCDirect::logf(const char *format, ...) {
  if (!_log || !format) {
    return;
  }
  char buffer[256];
  va_list args;
  va_start(args, format);
  vsnprintf(buffer, sizeof(buffer), format, args);
  va_end(args);
  _log->print(buffer);
}

void ESP32UVCDirect::setError(const char *message) {
  _lastError = message ? message : "";
}
